cf/Documents/Письмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Письмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СвязанныеДокументы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомуСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КопияСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Catalogs/ПрофильИнтернетПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПрофильИнтернетПочты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервераSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Documents/Письмо/Forms/Письмо2/Ext/Form/Module.bsl
&НаКлиенте
Перем мВведенныйПароль, мПарольВведен;

#Область Типовые

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда  // Заполним по умолчанию
		
		Объект.Автор 	= ПараметрыСеанса.ТекущийПользователь; // чтобы корректно отображался отбор по владельцу у профиля у нового письма
		Объект.Профиль 	= Почта2Сервер.ПолучитьПрофильПоУмоланию();
		Объект.Текст 	= Объект.Профиль.Шаблон; КонецЕсли;
	
	
	
		Если Параметры.Кому <> Неопределено И Параметры.Кому.Количество() Тогда
			Параметры.Кому[0].Свойство("Партнер", Объект.Партнер); 
			ДобавитьКому(Параметры.Кому); 
		//Копия
	ОсМен = Объект.Партнер.ОсновнойМенеджер;
	Если Не ОсМен = ПараметрыСеанса.ТекущийПользователь и Не ПустаяСтрока(ОсМен.Почта) Тогда
	ДобавитьКопия(Объект.Партнер);  КонецЕсли;КонецЕсли;
		
	Если Параметры.Вложения <> Неопределено Тогда КонвертацияТипов.ДобавитьТаблицуКДругойТаблице(Объект.Вложения, Параметры.Вложения) КонецЕсли;
	
	// Отобразим
	
	ОбновитьПредставлениеВложений();
	ОбновитьПредставлениеПолучателей("КомуСписок");
	ОбновитьПредставлениеПолучателей("КопияСписок");
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Установим доступность
	
	Элементы.Отправить.Видимость 		= Не ТекущийОбъект.Проведен;
	Элементы.ГруппаВложений.Видимость 	= ТекущийОбъект.Вложения.Количество();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗагрузкаВложений = Новый Массив;
	
	// загрузим вложения во временное хранилище если их нужно загружать
	
	Инд = -1;
	Для Каждого Строка Из Объект.Вложения ЦИкл Инд = Инд + 1;
		
		Если Не ПустаяСтрока(Строка.ПолноеИмяФайла) Тогда
		
			Адрес = "";
			Если Не ПоместитьФайл(Адрес,  Строка.ПолноеИмяФайла,, Ложь, УникальныйИдентификатор) Тогда
				
				Отказ = Истина;
				ПоказатьПредупреждение(,"Не удалось записать файл в базу: " + Строка.ИмяФайла,,"Ошибка записи"); 
				Возврат; КонецЕсли;
			
			ЗагрузкаВложений.Добавить(Новый Структура("Инд, Адрес", Инд, Адрес));
			
			// Удалим за собой файл
			Если УдалитьФайлыПослеОтправки Тогда УдалитьФайлы(Строка.ПолноеИмяФайла); КонецЕсли; КонецЕсли; КонецЦикла;
			
	// Передадим в процедуру сервера перед записью
			
	Если ЗагрузкаВложений.Количество() Тогда
		ПараметрыЗаписи.Вставить("ЗагрузкаВложений", ЗагрузкаВложений); КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Перем ЗагрузкаВложений;
	
	// загрузим вложения на сервер
	
	Если ПараметрыЗаписи.Свойство("ЗагрузкаВложений", ЗагрузкаВложений) Тогда
		
		Для Каждого Вложение Из ЗагрузкаВложений Цикл ТекущийОбъект.Вложения[Вложение.Инд].Вложение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Вложение.Адрес)) КонецЦикла; КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Обработка // вложений

&НаСервере
Процедура ДобавитьКому(текКому)
	
	Для Каждого Кто Из текКому Цикл 
		
		НовСтрока = Объект.КомуСписок.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Кто);
		НовСтрока.Кому 	= ?(Кто.Свойство("Почта"), Кто.Почта,Почта2Сервер.ПолучитьПочтуПартнера(Кто.Партнер)); КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКопия(текПартнер)
	  		
		НовСтрока = Объект.КопияСписок.Добавить();
		НовСтрока.Партнер = текПартнер;
		НовСтрока.Кому 	= текПартнер.ОсновнойМенеджер.Почта; 
		
КонецПроцедуры
&НаСервере
Процедура ДобавитьВложения(текКому)
	
	Для Каждого Кто Из текКому Цикл 
		
		НовСтрока = Объект.Кому.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Кто);
		НовСтрока.Кому 	= ?(Кто.Свойство("Почта"), Кто.Почта, Почта2Сервер.ПолучитьПочтуПартнера(Кто.Партнер)); КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеВложений()
	
	// Нарисуем вложения красиво
	
	ФормСтроки 	= Новый Массив;
	ЭтоНовый 	= Объект.Ссылка.Пустая();
	
	Инд = -1;
	Для Каждого Строка Из Объект.Вложения Цикл Инд = Инд + 1;
		
		Если Инд Тогда ФормСтроки.Добавить(Новый ФорматированнаяСтрока("; ")); КонецЕсли;
		
		ФормСтроки.Добавить(Новый ФорматированнаяСтрока(Строка.ИмяФайла,,,,Формат(Инд, "ЧН=0; ЧГ=")));
		
		Если ЭтоНовый Тогда 
			ФормСтроки.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.Удалить,,,,"Удалить" + Формат(Инд, "ЧН=0; ЧГ="))); КонецЕсли; КонецЦикла;
	
	СтрВложения = Новый ФорматированнаяСтрока(ФормСтроки);
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьПредставлениеПолучателей(ИмяТаблицы)
	
	Стр = "";
	Для Каждого Строка Из Объект[ИмяТаблицы] Цикл 
		
		стрПартнер = ?(Строка.Партнер.Пустая(), "", "(" + Строка.Партнер + ")");
		Стр = Стр +?(Стр = "","","; ") + Строка.Кому + " " + стрПартнер; КонецЦикла;
	
	ЭтотОбъект["Стр" + ИмяТаблицы] 	= Стр;
	Объект.Кому 					= стрКомуСписок;
	Объект.Копия                    = стрКопияСписок;
КонецПроцедуры


&НаСервере
Функция ПолучитьАдресДанныхПоИндексу(Инд)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Вложение ИЗ Документ.Письмо.Вложения ГДЕ Ссылка = &Ссылка И НомерСтроки = " + Формат(Инд + 1, "ЧГ="));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат ПоместитьВоВременноеХранилище(Выборка.Вложение.Получить());
	
КонецФункции


&НаКлиенте
Процедура ВложенияОбработкаНавигационнойСсылки(Элемент, НавСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Найти(НавСсылка, "Удалить") = 1 Тогда
		
		Индекс = Число(Сред(НавСсылка, 8));
		Объект.Вложения.Удалить(Индекс);
		ОбновитьПредставлениеВложений();
		
	Иначе
		
		Индекс = Число(НавСсылка);
	
		// Получим
		
		Строка = Объект.Вложения[Индекс];
		Если Не ПустаяСтрока(Строка.ПолноеИмяФайла) Тогда
			
			Имяфайла = Строка.ПолноеИмяФайла;
			
		Иначе
			
			Имяфайла = КаталогВременныхФайлов() + Строка.ИмяФайла;
			ДвДанные = ПолучитьИзВременногоХранилища(ПолучитьАдресДанныхПоИндексу(Индекс));
			
			// Запишем
		
			Попытка
				ДвДанные.Записать(Имяфайла);
			Исключение
				стрОшибки = ОписаниеОшибки();
				ОбщиеФункции.СообщитьТекст("Ошибка открытия файла
												|" + стрОшибки);
				Возврат КонецПопытки; КонецЕсли;
		
		// Откроем
		
		ЗапуститьПриложение(ИмяФайла); КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Выбор // Партнеров

&НаСервере
Функция ПолучитьСтрТаблицу(ИмяТаблицы) Экспорт
	 
	Возврат ЗначениеВСтрокуВнутр(Объект[ИмяТаблицы].Выгрузить());
	
КонецФункции
&НаСервере
Функция ПолучитьзнПартнер() Экспорт
	 
	Возврат Объект.Партнер;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьСтрТаблицу(стрТаблица, ИмяТаблицы)
	
	Объект[ИмяТаблицы].Загрузить(ЗначениеИзСтрокиВнутр(стрТаблица));
	ОбновитьПредставлениеПолучателей(ИмяТаблицы);
	
КонецПроцедуры
&НаКлиенте
Процедура стрКомуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Документ.Письмо.Форма.ВыборПолучателей", Новый Структура("стрТаблица,знПартнер", ПолучитьСтрТаблицу("КомуСписок"),ПолучитьзнПартнер()),,,,,Новый ОписаниеОповещения("ВыборПолучателей", ЭтаФорма, "КомуСписок"));

КонецПроцедуры
&НаКлиенте
Процедура ВыборПолучателей(стрРезультат, ИмяТаблицы) Экспорт
	
	Если стрРезультат <> Неопределено Тогда Модифицированность = Истина;
		ЗагрузитьСтрТаблицу(стрРезультат, ИмяТаблицы); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура стрКомуПриИзменении(Элемент)
	
	// Запомним партнера
	
	стПартнер = ?(Объект.КомуСписок.Количество(), Объект.КомуСписок[0].Партнер, Неопределено);
	
	// Очистим всю таблицу и будем считать что партнер 1	
	
	Объект.КомуСписок.Очистить();
	НовСтрока = Объект.КомуСписок.Добавить();
	
	НовСтрока.Кому 		= стрКомуСписок;
	НовСтрока.Партнер 	= стПартнер;
	
	ОбновитьПредставлениеПолучателей("КомуСписок");
	
КонецПроцедуры

#КонецОбласти

#Область Отправка // письма

&НаСервере
Функция ПолучитьПрофиль()
	
	Запрос = Новый Запрос("ВЫБРАТЬ АдресСервераSMTP, ПортSMTP, ПользовательSMTP, ПарольSMTP ИЗ Справочник.ПрофильИнтернетПочты ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.Профиль);
	Возврат КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Запрос.Выполнить().Выгрузить());
	
КонецФункции
&НаКлиенте
Процедура Отправить(Команда = Неопределено, ВведенПароль = "")
	
	// сперва запишем документ
	//Если Модифицированность И Не Записать(Новый Структура("ФайлыНеУдалять", Истина)) Тогда Возврат КонецЕсли;
	
	Отказ = Ложь; // Проверим чтобы все было заполнено
	
	Если Не Объект.КомуСписок.Количество() Тогда 
		ОбщиеФункции.СообщитьТекст("Кому отправлять письмо?", "стрКомуСписок"); Отказ = Истина; КонецЕсли;
	
	Если Объект.Профиль.Пустая() Тогда 
		ОбщиеФункции.СообщитьТекст("Не указан профиль", "Объект.Профиль"); Отказ = Истина; КонецЕсли;

	// Заполним письмо
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = Объект.Тема;
	Письмо.Тексты.Добавить(Объект.Текст);
	
	// Добавим получателей
	
	Для Каждого Строка Из Объект.КомуСписок Цикл
		Если ПустаяСтрока(Строка.Кому) Тогда
			ОбщиеФункции.СообщитьТекст("Не указано кому", "Объект.КомуСписок"); Отказ = Истина; 
		Иначе
			Письмо.Получатели.Добавить(Строка.Кому);КонецЕсли; КонецЦикла;
	
	// Добавим копии
	
	Для Каждого Строка Из Объект.КопияСписок Цикл
		Если НЕ ПустаяСтрока(Строка.Кому) Тогда
						Письмо.Копии.Добавить(Строка.Кому);КонецЕсли; КонецЦикла;
	
	// Подключим профиль
	
	Если Не Отказ Тогда
		
		ПарольИзКеша = Почта2Клиент.ПолучитьПарольИзКеша(Объект.Профиль, глПаролиНаПочту);
	
		Профиль 			= Новый ИнтернетПочтовыйПрофиль;
		НастройкиПрофиля 	= ПолучитьПрофиль();
		//Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
		
		ЗаполнитьЗначенияСвойств(Профиль, НастройкиПрофиля);
		Если Не ПустаяСтрока(ВведенПароль) Тогда 					// Пароль прислали
			Профиль.ПарольSMTP = ВведенПароль;
			Почта2Клиент.УстановитьПарольВКеше(Объект.Профиль, ВведенПароль, глПаролиНаПочту);
			
		ИначеЕсли Не ПустаяСтрока(ПарольИзКеша) Тогда				// Получим пароль из ранне введенного в этом сеансе
			Профиль.ПарольSMTP = ПарольИзКеша;
			
		ИначеЕсли ПустаяСтрока(НастройкиПрофиля.ПарольSMTP) Тогда 	// Введем пароль
			ОткрытьФорму("Документ.Письмо.Форма.ВводПароля", Новый Структура("Почта, Логин", Строка(Объект.Профиль), НастройкиПрофиля.ПользовательSMTP),,,,,Новый ОписаниеОповещения("ВводПароля", ЭтаФорма)); Возврат; КонецЕсли;
		
		// Проверим подключения профиля
		
		Соединение = Новый ИнтернетПочта;
		
		Попытка
			Соединение.Подключиться(Профиль);
		Исключение
			стрОшибки = ОписаниеОшибки();
			Почта2Клиент.СброситьПарольВКеше(Объект.Профиль, глПаролиНаПочту);
			ОбщиеФункции.СообщитьТекст("Ошибка подключения
			|" + стрОшибки); Отказ = Истина ; КонецПопытки; КонецЕсли;

	// Проверим 
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	// Добавим вложения
	
	Инд = -1;
	Для Каждого Вложение Из Объект.Вложения Цикл Инд = Инд + 1;
		
		ДвоичныеДанные = ?(Не ПустаяСтрока(Вложение.ПолноеИмяФайла), Новый ДвоичныеДанные(Вложение.ПолноеИмяФайла), ПолучитьИзВременногоХранилища(ПолучитьАдресДанныхПоИндексу(Инд)));
		
		Если ДвоичныеДанные = Неопределено Тогда
			ОбщиеФункции.СообщитьТекст("Не удалось получить вложение, повторите попытку"); Возврат КонецЕсли;
		
		Письмо.Вложения.Добавить(ДвоичныеДанные, Вложение.ИмяФайла); КонецЦикла;

	// Пошлем
	
	Попытка
		Соединение.Послать(Письмо);
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка отправки письма
		|" + стрОшибки); 
		Возврат ; КонецПопытки;
	
	// Ехха!
	
	Соединение.Отключиться();
	ПоказатьОтправкуПисьма();
	
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	Закрыть(Объект.Ссылка);
	
КонецПроцедуры
&НаКлиенте
Процедура ВводПароля(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда Отправить(, Результат) КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтправкуПисьма()
	
	ПоказатьОповещениеПользователя("Отправлено письмо",, Объект.Тема + Символы.ПС + стрКомуСписок, БиблиотекаКартинок.ОтправленоПисьмо);
	
КонецПроцедуры

&НаСервере

Процедура КакБудтоОТправилиНаСервере()
	//Док = РеквизитФормыВЗначение("Объект");
	//Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//Закрыть(Док.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура КакБудтоОТправили(Команда)
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	Закрыть(Объект.Ссылка);
КонецПроцедуры


#КонецОбласти
